const modal = document.getElementById("modal");

const experience = [
  {
    title: "Khatwa Charitable Organization sudan embassy",
    org: "Media Office Officer",
  },
  {
    title: "Takaful Charitable Organization",
    org: "Head of content writing team",
  },
  {
    title: "MEI",
    org: "Content writer",
  },
  {
    title: "VMC",
    org: "Content writer",
  },
  {
    title: "Hult prize sust",
    org: "Media officer and social media Manager",
  },
  {
    title: "Khotwa Charity Foundation",
    org: "Rapporteur",
  },
  {
    title: "BMECS_Biomedical Engineering community sudan",
    org: "Co _founder/media officer /social media Manager",
  },
];

const experienceContainer = document.getElementById("exp");

for (let item of experience) {
  experienceContainer.innerHTML += `
            <div class="card">
				<h5>${item.title}</h5>
				<div class="pra">
					<p>${item.org}</p>
				</div>
			</div>`;
}

const lettrureWrites = [
  `على جابنيّ الطرِيق الرئيسي يصطف الكثيرون في إنتظار وسائِل النًقل … 
سيارات كثِيرة تمُر مُسرعة…تتوقف إحداها…  الكُمساري ينتَصب بقدمٍ واحُدة على حافة الباب ويصيح بنغمة ثابِتة ( عربي ..عربي...  عربي)
يتزاحم البعض على بوابتها… تمضي العَربة مُسرُعة بذات النهج الذي أتت بِه…ثم يحِل بعض الهُدوء إلى أن تآتي عربة أُخرى
على الحافة يقِف أربعيني…  يكسو جمال الشَباب و وقار الكِبر ملامحه… يُخالِط بعض الشّيب خِصلات شعرِه المُتناثِرة بلا إكتِراث  على وجهِه و مُقدِمة رأسه… يرتَدي قميص رمادي… يشبه لونه أيامه الرُوتينة المُكررة…يحمِل حقِيبة سوداء بدأت تتأكل زوايها بعامِل الزمن… 
كما هي العادة  يعُم الهُدوء مجددا  على موقف الحافلات الا من بعض الاصوات التي تلعن هذه الحياه… يمر الوقت متثاقلا وتدنو الشمس منك مقدار ما يذيب عقلك.. 
في لحظة الصمت تِلك يتذكر موعِد صرف راتِبه…طِفلته ذات الخمس أعوام التى إلتحقت لتوِها بالمدرسة… إيجار المنزل … ثرثرة زوجته الكثيرة… تأخْْذه ذاكرته أبعد قليلاً… لماضِيه الذي كان أكثر سلاماً مِن الآن… يتذكر سِنينه الأُولى بالجامِعة …حبِيبته الهادِئة التي تَزوجت فور تخرجهما... إمنياته في السفر حول العالم وسيارة أحلامُه سوداء اللون... يبتسم قليلاً... ثُم يقطع تسلسُل ذكرياته تِلك  كُمساري جديد… يُصيح بكُل صوتِه ( عربي.. عربي ..عربي) 
حافلة اخيرا!! 
أُحدق هْنا و هُناك… من النافِذة الأمامِية  تطُل عليّ تِلك الأم و طِفلها..  يجلُسان في المقعد الامامي…  تتناقش مع السائق في فشل هذه الحكومه و طفلها يبكي بقربها
عذرا
لكن لم اجد شيئ كفشلها في وضع مستحضرات التجميل 
من يضع احمر شفاه على الاجفان؟ 
بعد منتصف ساعه.. يزادا صراخ طفلها ليثقب م بقي من طبلة اذني.. حاولت ملاطفته كثيرا لكنه لم يأبه سوى لذاك اللون الفاقع الذي ارتديه.. ابتسم  بعد ان بح صوته من كثرة البكاء ابتسم وهو يفسدها
 لكن لا بأس  لله در  ابتسامته💛
 كأنه ُ زَهرة كانت على وشك أن تمُوت بالجَفاف فأنقذها المَاء في لحظتِها الأخيرة…. 
يزَيد غَطبتي أنها محطتي الاخيره  فرُغم الإرهاق والسَهر و الصُداع الذي يزِن برأسي… يعُود مَزاجي مُعتدلاً  مرة أُخرى... في نهايات هذا النهار الطويل المزدحم..  بالكثير من الأحاديث  والشجارات و الإبتسامات المهدرة بلا إكتراث...
أجلس قليلا  و أضع هاتفي بجانبي…ثم أفكر في خيارات جيدة لِما تبقى من اليوم … 
حاولت ان أقاوم آلام الظهر المعتاده من  الجلوس على مقاعد حافلات العربي والميناء البري لساعاتين ونصف يوميا
اخذت بعض المسكنات من حقيبتي وأذهب بعدها إلى غرفتي محاولة النوم قليلا عل ذلك يخفف عني قليلا...
 لكنني استيقظت فجأة بصداع كاد ان يشق رأسي 
نظرت لسقف الفُرفة… في المُنتصف تتحرك  المروحة برتابة...عند الزاوية عنكبوت يتحرك ببطء… جُدران الغرفة يكُسوها اللون البنفسجي الغامق… والنوافذ مُعتمة اللون.. لم أُحدد الزمن بِدايات الصَباح ..أم نِهايات المساء… تحسست الأشياء حولي… كانت هنالك حقيبة ملقاة على الأرض… اوراق تمارين علي الكُرسي اشتريتها منذ شهر....لم أُنهي حلها  بعد… خمار رمادي  به بعض الفراشات بجانبي… و نصف كوب ممتلئ  بالماء 
وجدتُ قد مضت أربعة ساعاتٍ من موعِد المُنبه الذي حددتهْ على هاتِفي… لم أُدرك أين كان الخطأ... والوقت مُحدد بدِقة...النغمة حادة وتُحدث إهتزازت منتظِمة مُتكرِرِة… لكنني لم أستيقظ أبداً… حين إُستقظيت حاولت مُحادثة صدِيقتي على الهاتِف.. فوجدتني فقدُت كل مهاراتي في التواصل سِوى الكِتابة…فبعثت لها رِسالة نصية لكنها لم ترد حتى بعد مضيّ ساعتين و أكثر… 
مضت بالفعل اربعة ساعات… فتحت هاتفي مرة إُخرى… وجدت ما يُقارب الألف رِسالة على تطبيقات التواصُل الإجتماعي و تسجِيلات صوتية كثيرة… معظمها لأصدقائي تحمِل كل انواع اللوم عن عدم السؤال عنهم  والرد المتأخر مر ببالي قائمة الأشخاص الذين لم ارسل لهم…والرسائِل التي لم أرُد عليها أيضاً…
أصابني صوت تنبه هذه الرسائل الكثيرة بالذُعر… فأغلقت شبكة الإنِترنت...
الضوضاء تملأ أَفكاري و هذه الغرفة الصغيرة يملأها صوت مذيع من قناة إخبارية عالِمية… في نشرتِه المسائِية اليوم…إستوقفني حماس المذيع... ملامِحِه  الفزِعة و صوته المرتجف قليلاً في حدُيثه عن زِيادة مُعدلات الإصابة بالفيروس المُنتشر حديثاً  في الصين و تضاعُف عدد الوفيات منِ الإسبوع الماضي… 
 و في إِستطلاعٍ خارجي أيضا … تحدث فيه عدد مِن  المَارة عن مخاوفِهم المتزايِدة  حيال الوباء الجديد… 
هُنالك مُربع أحمر اللون صغير في أعلى الشاشة… يحمِل عدد الِإصابات الجَديدة  و  عدد الوفِيات و شرِيط أَزرق أسفل الشاشة يُعيد تُكرارا…  ضرورة الِإلتزام بالتعليمات العامة  و طُرق الوقاية...
و حقيقة أننا  نُصاب دوما بالهَلع من كُل ما يؤدي  للموت… رُغم أنه حقيقتنا الكُبرى…
يُعيد المُذيع ذات الأخبار مرة  تُلو الأخُرى… ثُم فجآة ينقطِع التَيار الكُهربائي… و يَسود الصمت المكان… و يملأ السواد الشاشة التِلفزيونية…..
المكان فارِغ تماماً… سِوى ضوء القمر المُتسرِب عبر النافِذة الخلفية … ضوءه كان  هادئاً و دافئا جدا… ككل الأشياء الجَميلة التي لا يُحدث وُجودها إي نوع مِن الضوضاء… يتسرب ضوء القمر بهدوءه لذاكرتي…يُعيدني لأشيائي التي أُحبها… ضِحكة أْمي و هي تُغمض عينيها...صوت أبي وهو يُؤذن للفجر… خطوات إبنة أختي الصغيره و كلِماتها الُأولى...مُحادثاتي الطويلة مع أصدقائي وجلسات (الغابه)… تآخدني ذاكِرتي … أَبعد و أَبعد… حيث طُفولتي… (لعبة شِليل) أغاني سبيستون( التي كنا نسهر عليها انا )… حكايات جدتي (فاطمة السمحة وحسن الشاطِر) بذات ضوء القمر…أبتسِم لا إرادياً……ثم فجأة أُخرى يعُود التيار الكهربائي مجدداً و يختفي ضوء القَمر كأنه يهرب من كل هذا الضَجيج والصخب....
ثم تتزاحم الأشياء مجدداً…..ضوء المصباح الأبيض المتوهج…حركة المروحة الرتيبة… و يطل ذاك المذيع مرة أخرى…بذات النبرة..  معلناً عن إزياداد عدد   البلدان  المعرضة للوباء… و إرتفاع حالات الإصابات والوفيات.
اظن ان وباءا مثل هذا ان أصاب هذا الشعب سيقضي علينا جميعا اغلقت التلفاز بكل تشاؤم 
 كتبت أشياء كثيرة على مُذكِرة هاتفي  …صوتي كان يخرج عبر تلك الحُروف.... إنها مُحاولتي الخامسة لكتابة ذات النص…. كُل مرة  يزداد ذلك الإِحساس وتزداد  المشاعر التي أودّ تدوينها بين هذِه السُطور… 
أقضي الليل و أنا أُحاول مُقاومة  الأَرقّ….لكننّي أفشل…تُتطاردني ذِكريات النهار  و وُجُوه الناس الذين فارقوا الحَياة…. 
لِماذا مِنّ بين ألالاف اللحظات المُبهِجة في الحياة… نكُون حُضُوراً في أكثر اللَحظات ضُعفاً و ألماً في حياة الأخرين؟
 مُنذ مُدّة و الكثير مِن الناس يموتون  أمام عينايّ…. و أنا لا أنسى  الذين ماتوا أبداً… كأّن أرواحِهم تتَرك شئً مِنها بذاكرتي… 
رُغم تكراره… الموت لايُشبه أي شئ…  لا يُمكِن توقُعه أو إِعتياده أبداً…يحدُث كل مرة… كأنها المرة الأُولى…. 
اللحظات الأخيرة لِكُل أحد  لا تُشبِه آخر…و موت مِئات الغُرباء لا يُشبه موت قريب واحد…. و كُل لحظةٍ أخيرة حُزنُها مُختَلف….بدأً مِن نبضات القًلب الأخيرة و بُرود الأطراف  إلى إتساع بُؤبُؤ العَينين …   والدمعة الأُولى…  قِراءة الفاتحة…. ثُم الصِراخ والعَويل…
رُغُم أَنهُ  صُورة مِن صُور الحُزن الكثيرة التي تملأ  العالم و تتَكرر دائماً إلا أنني يُلاحقَني إِحساس عظيم بالذّنب في كُل مرة يموُت فُيها أحد…أشعر كأنني مسّؤُولة عن موتِه….
ومعَ كُل شخص يموت أُصاب بِذات الحُزن…
أول شخص مات ليّ كان طفلا يبلغُ مِن العُمر تسع سنوات…. مُنذ وهلتِه الأُولى  وهو  مُصاب بمرضٍ عِضَال في القلب… مَكث في المَشفي ما يُقارب الإسبُوعين ثم توفي في بيته امام عيني… لا زِلت أذكر ملمس يديه الناعُمتين و خُصلات شعره المنسدلة على وجهه… نظرة عينيه وصَرختِه الأخيرة….  وجهُه الصغير كَان يُلاحقني في أحلامي لثلاث ليالي مُتتَالية…أستيقظ مهلُوعة …. و تلاحقني ذات الاسئلة… ماذا لو أَنني إِستطعَت إنقاذِه…. أو إِعادة قَلبِه للحياة ؟
 حِينما أخبرتُ صَديقتي قالت لي إِنها فَقط المرة الأُولي وسأعتاد الأمر لاحقاً… وأن المرات الُأولى للأشياء لا تُنسى … لكنني فشِلت في إعتياد الأمر  أبداً… 
بذاكرتي  تمُر  اللَحظات الأخيرة التي شهِدتها لِكُل الناي كفِيلم قَصير سريع العَرض…. ثُم يَتوقف لبُرهَة عِند ذلِك الوَجّه… لم تُفارِقني تَفاصيلَه من حينها… كَان لفتاة تبلغُ مِن العُمر تسعة عشر عاماً…  إحتفَت بمولودِها الأول مُنذ شَهر… وكان إحتفائِها الأخير….
منُذ يومِها الأول بالمشفى و ملامِحها لا  تفسير لها…. لا تُبدي أي إِنفعالات سُوى نِصف إبتسامة حين تُرضُع صغيرَها …. كانت مُصابة باللارَغبة … وبعد يومين أخرين لحِقها قَلبُها بِذات اللارغبة و توَقف فجأةً  ذات مساء ٍبَغيض…. 
أربعُون دقِيقِة كان الاطباء يستجدون فِي قَلبَها للعودة للحياة مجدداً… 
في صَمت تِلك اللَحظات المُهيب كُنت أَدعو لقلبها أُن يتسجيب لمُحاولاتِ الاطباء البائِسة… 
أربعوُن دقِيقَة كانت مليئة بكل شئ…. بُرود النِهايات  بجسدِها الهامد… شغَف الحياة من صرخات طفلها… وحُزن الفُراق من دُمُوع زوجها و صراخ أقارِبها…. 
أربعُون دقيقة … أتذكَرها ثانية تِلوّ الأُخرى…
أحملها بذكراتي الخَرِبة مُنذ شهر كمَا هيّ….
 في لحظَات الأَرقّ تِلك أشعُر بيدايّ رَطِبتَان  مُجدداً كما لحظة مَوتِها …..فأغمِض كفتَا يدايّ هرباً مُن ذلِك الإحساس…. و أُفكِر  في العَبثِية التي يَستطيع بِها المَوت حَشوّ نِهاياتِنا….`,
  `عود للمرة الثانيةِ بعد المِئة لأنثر الملح على جُرحي القديم، أعاود الإستياء بذاتِ الغصة وذات دموع الليلةِ الأولى . 
  جزءٌ من ذكرياتِ المرء تظل عالِقة بذهنه، لتعود كل يوم بعد أن يخلع عنه رداء النهار وتذكره بما هو حقاً عليه. 
  بعد كلِ فترة كنت أتوقف فيها عن كتابة النصوص كنت آمل أن يخلو نصي القادِم من بعضِ السوداوية، أن تحمل الحروف حُزناً أقل وبهجةً أكثر


كمحاولةٍ لصياغةِ نصٍ سعيد


لكن دائماً ما تؤول الأمور إلى هنا....`,
  `الواحده بعد منتصف الليل :
حسناً انّها محاولتِي الخامسةُ لكتابةِ ذات النص كل مرة يزْدادُ ذلك الإحساس وتزداد المشاعِر التي أودُ تدويّنها بين هذهِ السُطور
اقضي الليل وانا احاول مقاومة الأرق لكنني أفشل.. تطاردني ذكريات تلك الليله.. كانت مليئة بكل شيء.. اتذكرها ثانية تلو الأخرى... أحملها بذكراتي الخَرِبة كما هي منذ شهر...
_الخامس والعشرون من شهر مايو:
 راقدةً على جنبي الايسر ألفظ أنفاسي.. قلبي منسحق في ضلوعي.. صفراء معدتي تسلخ حلقي.. والعرق يكسوني كملاكم في جولته الثانية عشرة حاولت تحريك يدي فلم تتحرك تنميلاً كأن الدم في عروقي قد أُستبدل بصمغ عربي.. كان هناك شيء ضخم يجثم على صدري.. حاولت رفعت رأسي من الوسادة فسقط مجدداً كقطعة صخر.. عيناي مغلقتان بأسمنت سريع التصلب الصداع يزن برأسي.. تشوشت الاصوات في عقلي للحظة ادركت انها نهايتي لا محال صرخت و لم اسمع صوتي..  مر ببالي وجوه اصدقائي الذين تركتهم مسرعة دون أن اودعهم هذا الصباح.. أخي الصغير الذي وعدته ان اشتري له الحلوى هذا الصباح ونسيت كعادتي.. المرات التي صرخت فيها بوجه أمي.. صلواتي التي أخرتها.. مهلاً.. لا يمكن أن ارحل الان لدي الكثير بعد أريد حياة اخرى افعل فيها كل هذا
  مددت يدي بصعوبة إلى المنضده أبحث عن هاتفي لأستنجد بأحد.. اتصلت بوالدتي عدة مرات لكنها لم تجب لم استطع الصراخ.. جررت قدمي إلى الباب محاولة الخروج من هذه الغرفه لكن ضوءَ الهاتفِ الباهتِ لم يكن كافياً لإتقاء حافة السرير التي عانقتْ اصبع قدمي الصغير في ألمٍ وانا اقفز اتجاه الباب.. ما إن وطأت قدمي الارض حتى أحسست كأن ثقباً اسوداً قد انفتح في منتصف غرفتي يجرني إليه جراً فسقطت لأرتطم بطرف المنضدة بقوه احسست بشئ رطب تحت رأسي لقد كان ينزف... تشوشت الاصوات في رأسي وارتجت الدنيا قبل أن تدخل أمي 
نظرت إلى وجهها كانت ترمقني بقلق تحول إلى خوف سخونةُ ذِراعي كانت تكادُ تشعلُ الأرضَ من تحتيّ 
مر ذلك الشريط امام عيني مجدداً كفيلم عرض سريع .. هذه المره كانت وجوه الذين فارقوا الحياة 
منذ مدة والكثير من الناس يموتون امام عينايّ.. وأنا  لا أنسى الذين ماتو ابدا كأن ارواحهم تترك شيءً منها بذاكرتي.. 
رغم تكراره.. الموت لا يشبه  اي شيء.. لا يمكن توقعه او اعتياده أبداً... يحدث كل مرة كأنها المرة الأولى... 
اللحظات الأخيرة لِكل أحد لا تشبه آخر موت مِئات الغُرباء لا يُشبه موت قريب واحد…. و كُل لحظةٍ أخيرة حُزنُها مُختَلف….بدأً مِن نبضات القًلب الأخيرة و بُرود الأطراف  إلى إتساع بُؤبُؤ العَينين …   والدمعة الأُولى…  قِراءة الفاتحة…. ثُم الصِراخ والعَويل…
رُغُم أَنهُ  صُورة مِن صُور الحُزن الكثيرة التي تملأ  العالم و تتَكرر دائماً إلا أنني يُلاحقَني إِحساس عظيم بالذّنب في كُل مرة يموُت فُيها أحد…أشعر كأنني مسّؤُولة عن موتِه….
ومعَ كُل شخص يموت أُصاب بِذات الحُزن…
أول شخص مات ليّ كان طفلا يبلغُ مِن العُمر تسع سنوات…. مُنذ وهلتِه الأُولى  وهو  مُصاب بمرضٍ عِضَال في القلب… مَكث في المَشفي ما يُقارب الإسبُوعين ثم توفي في بيته امام عيني… لا زِلت أذكر ملمس يديه الناعُمتين و خُصلات شعره المنسدلة على وجهه… نظرة عينيه وصَرختِه الأخيرة….  وجهُه الصغير كَان يُلاحقني في أحلامي لثلاث ليالي مُتتَالية…. و تلاحقني ذات الاسئلة… ماذا لو أَنني إِستطعَت إنقاذِه…. أو إِعادة قَلبِه للحياة ؟
فجأة إنتشلني صوت المنبه من كل هذا
استيقظت بصداع مروع وجدت قد مضت أربعة ساعات من موعد المنبه الذي حددتهُ على هاتفي.. لم أدرك أين كان الخطأ.. الوقت محدد بدقة.. النغمة حادة وتحدث اهتزازت منتظمةٍ متكررة لكنني لم استيقظ.. 
 جلست في طرف السرير  ثلاثة دقائق أحاول فهم ما حدث لأدرك في الدقيقة الرابعة ان كل هذا كان كابوساً.. كان أصدق من حقيقة...
 سرت قشعريرة في جسدي حين ان أدركت انني كنت على هاوية الموت تحسست أصبع قدمي الصغير لقد كان ينزف.. في لحظات الأرق تلك اشعر بيداي رطبتان مجدداً كما لحظة موتها.. فأغمض كفتا يداي هرباً من ذلك الإحساس..و أفكر في العبثية التي يستطيع بها الموت حَشوّ نِهاياتِنا....
`,
];

const contentWrites = [
  `"You don't need a rocket to be a pioneer - لست بحاجة إلى صاروخ لتكون رائداً " 

الأفكار سهلة وشائعة، كل شخص لديه أفكار تأخذ أكبر من حجمها، ومبالغ في تقديرها. التنفيذ هو كل ما يهم ويميز رواد الأعمال. 
بالحديثِ عن الإنجاز وريادة الأعمال هل سمعتُم عن:

"IEEE Region8 Entrepreneurship"?

"الأسبوع العالمي لريادة الأعمال"

هو عبارة عن مجموعة من الأنشطة والمسابقات تُقام في شهر نوفمبر من كل عام، تهدُف إلى إكتشاف رواد الأعمال الشباب وتوفير الدعم والإرشاد عن طريق خلق أرضية تفاعلية مع ذوي الخبرة في مجالاتهم.
يُقدم البرنامج ورش تدريبية وفُرصة للمنافسة التي تساعد بدورها على الإبتكار والإبداع.
 
لمزيد من التفاصيل زورونا في الورشة التعريفية يوم السبت المُوافق 19/11 الساعة 3:00 - 6:00pm.
-قاعة شُهداء الثورة (المجمع الغربي).

والآن أعزائنا المتابعين هل أنتم مستعدون لهذا الحدث الكبير! 💙

#IEEE
#IEEERegion8
#IEEEAfrica
#IEEESudan
#IEEESUSTech
`,
  `أعِزائنا المتابعين
السادة المهتمين بمجال ريادة الأعمال، عطفاً على المنشور السابِق في التعريف بأسبوع ريادة الأعمال نُقدم لكُم ورشة بعنوان :

"Workshop for contests and entrepreneurs"

تستهدف الورشة أصحاب الأفكار الصغيرة والمشاريع الكبيرة لمساعدة روادنا المستقبليين في تحقيق أقصى استفادة مالية ومجتمعية من أفكارهم الصغيرة ومن ثم فتح باب الترشح للمشاركة في المسابقة. 
وذلك يوم الأربعاء المُوافق 23/11
بقاعة(شهداء الثورة - المجمع الغربي)
يمكنكم الآن التسجيل لحضور الورشة عبر الرابط الآتي :
https://forms.gle/cjn5gT8qnqrAqRby6

كونوا على الموعد! 💙

#IEEE
#IEEERegion8
#IEEEAfrica
#IEEESudan
#IEEESUSTech
`,
  `[ Translation Below ]

Dear followers 💙! 

After the stages of the elections process have passed, which were represented in the plans presentation, voting for  candidates and counting votes within the branch, we are delighted to introduce the new executive office of the IEEE SUST Branch. Represented by: 

1- Neemat Abdelrahim - (President)
2- Ahmed Abdelrahman - (Vice-President)
3- Ruba Salih - (Secretary)
4- Mohammed Ibrahim - (Treasurer)
5- Rahaf Elamin - (HRs Manager) 

The procedures of handing over and receiving between the former and the current Offices are taking place. 

We congratulate our chosen leaders for being qualified for these positions, and we hope that they will lead the branch to fulfil its objectives and maintain its values ​​and superiority in various fields.

متابعينا الأعِزاء! 🤍

بعد انقضاءِ مرَاحلِ العمليِّة الانتخابية المتمثِلة في عرضِ الخُطط  لجميع المترشحين وعمليات التصوِيت والفرز داخلَ الفرع الطلابي، بكلِ فخرٍ نقدمُ لكم  المكتب التنفيذي الجديد لجمعية IEEE Sust branch. المُتمثِل بدوره في :

1- نعمات عبدالرحيم-(رئيس الفرع الطلابي)
2- أحمد عبدالرحمن-(نائب رئيس الفرع الطلابي)
3- رُبا صالح-(سكرتير الفرع الطلابي)
4-محمد إبراهيم-(الأمين المالي للفرع الطلابي)
5-رهف الأمين-(مسؤول الموارد البشرية في الفرع الطلابي)

بين السابِق والحاضِر تتم إجراءات التسليم والتسلُّم، وجوهٌ وكفاءاتٌ جديدة خَلفت سابِقتها في قيادة الجمعية. 

نبارك مجدداً لقادِتنا المُختارين لِتأهُّلهم لهذه المناصِب ونرجوا أن يقودوا الجمعية لتحقيق جميع أهدافها وأن تحافظ على قِيمها وتميزها في شتى المجالات.
`,
  `بسم الله الرحمن الرحيم
اللجنة التنسيقية لطلاب الهندسة - جامعة السودان

من منشورنا الفات فكّرتو يعني شنو إتحاد طلاب خدمي نزيه؟
كمِّلوا المنشور للنهاية! 🔥

إذا كنت من الجيل العاصر عهد الإتحاد في الجامعة؛ ح تكون عارف أهميته بالنسبة لينا كطلاب وليه نحن دائماً بننادي ونكرر جملة:
 "الإتحاد هو الحل!"
وليه التنسيقية سَخَرَت جهودها في كَونها لجنة تَسييرية لإعادة تكوين إتحاد طلاب خدمي نزيه.

وإذا إنت من الجيل اللي ما حضر عهد الإتحاد ف الندوة دي اتعملت عشانك! 

ندوة بعنوان: 
"إتحاد الطلاب .. بين الواقع والمأمول"

عشان تعرف الإتحاد دا شنو وملف تكوين الإتحاد وصل وين، وعشان نجاوب على تساؤلاتكم حول الإتحاد🔥

مع المتحدثين:  
١. عبد الناصر عوض الله
٢. محمد هاشم الجاز

 يوم: الثلاثاء/ ٩ أغسطس
  في قاعة الشهيد محمد هاشم مطر (القاعة ١٣).
من الساعة ١١ - ١ م 

#إعلام_اللجنة
#الاتحاد_هو_الحل
`,
  `من الغربِ إلى الجنوب   

أعزائنا المُتابعين،محطُتنا هذه المرة بالمجمع الجنوبي بجامعةِ السودان  لنتعرف معكم على تخصصين من أهم التخصصات
وهما :
الهندسة الكهربائية
وهندسة الإلكترونيات
مع نُخبة من أميز المتحدثين ومحاور شاملة، دعونا نلتقي بكم
يوم السبت الموافق(15/12) 
كونوا على الموعد 🔥
`,
];

const lecWriteContainer = document.getElementById("lecWrite");
const contentWriteContainer = document.getElementById("contentWrite");

for (let i = 0; i < lettrureWrites.length; i++) {
  lecWriteContainer.innerHTML += `
            <div class="card">
				<i class="fas fa-pen"></i>
				<div class="pra">
					<p>${lettrureWrites[i].slice(0, 300)} ...</p>
	
					<p style="text-align: center;">
                    <button onclick="handleClick(${i} , 'lec')" class="button">Read More</button>
					</p>
				</div>
            </div>
    `;
}

for (let i = 0; i < contentWrites.length; i++) {
  contentWriteContainer.innerHTML += `
            <div class="card">
				<i class="fas fa-pen"></i>
				<div class="pra">
					<p>${contentWrites[i].slice(0, 300)} ...</p>
	
					<p style="text-align: center;">
                    <button onclick="handleClick(${i} , 'con')" class="button">Read More</button>
					</p>
				</div>
            </div>
    `;
}

function handleClick(i, type) {
  if (modal.classList.contains("d-none")) {
    modal.classList.remove("d-none");
  } else {
    modal.classList.add("d-none");
  }

  const content = type === "lec" ? lettrureWrites[i] : contentWrites[i];
  modal.innerHTML = `
        <button onclick="handleClick(${i})" class="button">back</button>
        <div class="modal-card">
			<div class="pra">
				<p>${content}</p>
			</div>
		</div>
  `;
}
